function Adm(X, Y, T, N, h)
disp('Экстраполяционный метод Адамса:');
syms x;
syms y;
syms f(x,y);
f(x,y) = -1*y*(x + 1);
D = zeros(N+3, 7);
D(:, 1) = X;
D(1:5, 2) = T;
D(1:5, 3) = h * f(D(1:5, 1), D(1:5, 2));
D(1:4, 4) = D(2:5, 3) - D(1:4, 3);
D(1:3, 5) = D(2:4, 4) - D(1:3, 4);
D(1:2, 6) = D(2:3, 5) - D(1:2, 5);
D(1, 7) = D(2, 6) - D(1, 6);
for k = 5 : N + 2
    delta = D(k,3) + (1/2)*D(k-1, 4) + (5/12)*D(k-2, 5) + (3/8)*D(k-3, 6) + (251/720)*D(k-4, 7);
    D(k+1, 2) = D(k, 2) + delta;
    D(k+1, 3) = h*f(D(k+1, 1), D(k+1, 2));
    D(k, 4) = D(k+1, 3) - D(k, 3);
    D(k-1, 5) = D(k, 4) - D(k-1, 4);
    D(k-2, 6) = D(k-1, 5) - D(k-2, 5);
    D(k-3, 7) = D(k-2, 6) - D(k-3, 6);
end
Z = abs(Y(1:N-2)' - D(6:N+3, 2));
disp(' Точки    Приближенные значения     Абсолютная погрешность');
for i = 6 : N + 3
    fprintf('%6.1f        %6.8f             %6.12f\n', X(i), D(i, 2), Z(i-5));
end
fprintf('\n')
end

