function Elr (X, Y, N, h)
syms x;
syms y;
syms f(x,y);
f(x, y) = -y*(1+x);
disp('Методы Эйлера:');
F = zeros(N+1, 1);
F(1, 1) = 1;
disp('Явный метод Эйлера');
disp(' Точки    Приближенные значения     Абсолютная погрешность');
for k = 2 : N + 1
    F(k, 1) = F(k-1, 1) + h*f(X(k-1), F(k-1, 1));
    fprintf('%6.1f        %6.8f             %6.12f\n', X(k), F(k, 1), abs(Y(k) - F(k, 1)));
end
disp('Усовершенствованный метод Эйлера');
disp(' Точки    Приближенные значения     Абсолютная погрешность');
E = zeros(N+1, 1);
E(1, 1) = 1;
for k = 2 : N + 1
    E(k, 1) = E(k-1, 1) + h*(f(X(k-1), E(k-1, 1)) + f(X(k), F(k, 1)))/2;
    fprintf('%6.1f        %6.8f             %6.12f\n', X(k), E(k, 1), abs(Y(k) - E(k, 1)));
end

disp('Метод Эйлера - Коши');
disp(' Точки    Приближенные значения     Абсолютная погрешность');
G = zeros(N+1, 1);
G(1, 1) = 1;
for k = 2 : N + 1
    G(k, 1) = G(k-1, 1) + h*f(X(k-1) + h/2, G(k-1, 1) + h*f(X(k-1), G(k-1, 1))/2);
    fprintf('%6.1f        %6.8f             %6.12f\n', X(k), G(k, 1), abs(Y(k) - G(k, 1)));
end
end

